# _*_ coding : UTF-8 _*_
# 开发人员 : ChangYw
# 开发时间 : 2019/7/15 11:25
# 文件名称 : HomeWork.PY
# 开发工具 : PyCharm

"""
这是简单的Python演示
多行注释
"""

#1
print("Go Big Or Go Home!")
print("---------------------------------------")
#2
print("10.24（程序员之日）寓意： ")
print("    低调、踏实、核心     ")
print("  1024M=1G，谐音一级棒   ")

print("---------------------------------------")
#3
print("        Python学习中心           ")
print("用户名：_________________________")
print("密  码：_________________________")
print("验证码：_________________________3+5=？")

#4
#
姓名 = '张三'
# print(姓名)

print(姓名='张三')
print(id(姓名))