# _*_ coding : UTF-8 _*_
# 开发人员 : ChangYw
# 开发时间 : 2019/7/15 17:16
# 文件名称 : day01FinalHomework.PY
# 开发工具 : PyCharm

#1
# print('-------------------------------------------------------')
# print('|      天道不一定酬勤，深度思考比勤奋工作更重要！       |')
# print('-------------------------------------------------------')
# print('★+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++★')
# print('★                                                            ★')
# print('★                   纵有疾风起，人生不言弃                    ★')
# print('★                                                            ★')
# print('★+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++★')
# print('& '*15)
# print('&                           &')
# print('&     哪来直接登顶的人生      &')
# print('&     只有不断迭代的历程      &')
# print('&                           &')
# print('& '*15)

#2
# print('世界上最好的六个医生：')
# print('1.阳光')
# print('2.休息')
# print('3.锻炼')
# print('4.饮食')
# print('5.自信')
# print('6.朋友')

#4
# print('马云老师',' '*40,'阿里巴巴集团')
# print('Jack Ma',' '*50)
# print('*中国浙江杭州佬',' '*18,'*乡村教师代言人')
# print('*阿里巴巴001号员工',' '*15,'*桃花源生态保护基金会联席主席')
# print('*阿里巴巴合伙人',' '*18,'*INC（大自然保护协会）全球董事')
# print('*阿里巴巴一号公益志愿者',' '*11,'*联合国青年创业和小企业特别顾问')
# print('*阿里巴巴脱贫基金主席',' '*13,'*联合国青年创业和小企业特别顾问')
# print('*马云公益基金会创始人',' '*13,'*联合国世界妇女峰会联席会议联合主席')

# print('-'*50)
# print('|',' '*46,'|')
# print('|',' '*18,'单程  往返  接续换乘   退改签','|')
# print('|','车票',' '*41,'|')
# print('|',' '*25,'_'*20,'|')
# print('|','_'*8,' '*11,'出发地：简化/全拼/汉字',' '*4,'|')
# print('|',' '*7,'|',' '*15,'_'*20,'|')
# print('|',' '*7,'|','')


# print(' '*15,'轻松背单词  V2.0',' '*15)
# print('='*45)
# print('-'*45)
# print(' '*15,'1.单词背诵')
# print(' '*15,'2.发音合成')
# print(' '*15,'3.课本同步')
# print(' '*15,'4.成绩排行')
# print(' '*15,'5.退出程序')
# print('='*45)
# print('力线工作室',' '*5,'http://lianxian.net.cn')
# print('请使用↑↓或相应数字键选择菜单项，回车执行！！')

#6
# yue = 8
# print('话费余额：',yue,'元')
# money = int(input("请输入充值金额："))
# print('当前可用余额：',yue+money)

#8
# num = int(input("请输入要查看的星座数字或符号："))
# # 用户输入ASCII码，并将输入的数字转为整型
# if num == ':' :
#       print( " 对应的字符为", chr(9810))
# elif num == ';' :
#       print( " 对应的字符为", chr(9811))
# else :
#       a = num + 9800
#       print(a, " 对应的字符为", chr(a))


#10
# print("\u9AD8\u5C71\u6D41\u6C34\u9047\u77E5\u97F3")
#
# a = '我们爱学习'
# cBytes = bytes(a,encoding="gbk")
# print(cBytes)
#
# cBytes = bytes(a,encoding="utf8")
# print(cBytes)

#11

# print(chr(72),chr(97),chr(112),chr(112),chr(121),chr(32),chr(83),chr(105),
#       chr(110),chr(103),chr(108),chr(101),chr(115),chr(32),chr(68),chr(97),chr(121))

